update_constraint_mode -name func_mode -sdc_files CHIP_cts.sdc
set_ccopt_property update_io_latency false

create_ccopt_clock_tree_spec -file CHIP.CCOPT.spec -keep_all_sdc_clocks
source CHIP.CCOPT.spec

create_ccopt_skew_group -name all_output -source clk -sinks {
out_data_reg_7_/CK
out_data_reg_6_/CK
out_data_reg_5_/CK
out_data_reg_4_/CK
out_data_reg_3_/CK
out_data_reg_2_/CK
out_data_reg_1_/CK
out_data_reg_0_/CK
awaddr_s_inf_reg_16_/CK
awaddr_s_inf_reg_15_/CK
awaddr_s_inf_reg_14_/CK
awaddr_s_inf_reg_13_/CK
awaddr_s_inf_reg_12_/CK
awaddr_s_inf_reg_11_/CK
awaddr_s_inf_reg_10_/CK
comp_in_reg_0__0_/CK
comp_in_reg_0__1_/CK
comp_in_reg_0__2_/CK
comp_in_reg_0__3_/CK
comp_in_reg_0__4_/CK
comp_in_reg_0__5_/CK
comp_in_reg_0__6_/CK
comp_in_reg_0__7_/CK
comp_in_reg_1__0_/CK
comp_in_reg_1__1_/CK
comp_in_reg_1__2_/CK
comp_in_reg_1__3_/CK
comp_in_reg_1__4_/CK
comp_in_reg_1__5_/CK
comp_in_reg_1__6_/CK
comp_in_reg_1__7_/CK
comp_in_reg_2__0_/CK
comp_in_reg_2__1_/CK
comp_in_reg_2__2_/CK
comp_in_reg_2__3_/CK
comp_in_reg_2__4_/CK
comp_in_reg_2__5_/CK
comp_in_reg_2__6_/CK
comp_in_reg_2__7_/CK
comp_in_reg_3__0_/CK
comp_in_reg_3__1_/CK
comp_in_reg_3__2_/CK
comp_in_reg_3__3_/CK
comp_in_reg_3__4_/CK
comp_in_reg_3__5_/CK
comp_in_reg_3__6_/CK
comp_in_reg_3__7_/CK
comp_in_reg_4__0_/CK
comp_in_reg_4__1_/CK
comp_in_reg_4__2_/CK
comp_in_reg_4__3_/CK
comp_in_reg_4__4_/CK
comp_in_reg_4__5_/CK
comp_in_reg_4__6_/CK
comp_in_reg_4__7_/CK
comp_in_reg_5__0_/CK
comp_in_reg_5__1_/CK
comp_in_reg_5__2_/CK
comp_in_reg_5__3_/CK
comp_in_reg_5__4_/CK
comp_in_reg_5__5_/CK
comp_in_reg_5__6_/CK
comp_in_reg_5__7_/CK
comp_in_reg_6__0_/CK
comp_in_reg_6__1_/CK
comp_in_reg_6__2_/CK
comp_in_reg_6__3_/CK
comp_in_reg_6__4_/CK
comp_in_reg_6__5_/CK
comp_in_reg_6__6_/CK
comp_in_reg_6__7_/CK
comp_in_reg_7__0_/CK
comp_in_reg_7__1_/CK
comp_in_reg_7__2_/CK
comp_in_reg_7__3_/CK
comp_in_reg_7__4_/CK
comp_in_reg_7__5_/CK
comp_in_reg_7__6_/CK
comp_in_reg_7__7_/CK
comp_in_reg_8__0_/CK
comp_in_reg_8__1_/CK
comp_in_reg_8__2_/CK
comp_in_reg_8__3_/CK
comp_in_reg_8__4_/CK
comp_in_reg_8__5_/CK
comp_in_reg_8__6_/CK
comp_in_reg_8__7_/CK
comp_in_reg_9__0_/CK
comp_in_reg_9__1_/CK
comp_in_reg_9__2_/CK
comp_in_reg_9__3_/CK
comp_in_reg_9__4_/CK
comp_in_reg_9__5_/CK
comp_in_reg_9__6_/CK
comp_in_reg_9__7_/CK
comp_in_reg_10__0_/CK
comp_in_reg_10__1_/CK
comp_in_reg_10__2_/CK
comp_in_reg_10__3_/CK
comp_in_reg_10__4_/CK
comp_in_reg_10__5_/CK
comp_in_reg_10__6_/CK
comp_in_reg_10__7_/CK
comp_in_reg_11__0_/CK
comp_in_reg_11__1_/CK
comp_in_reg_11__2_/CK
comp_in_reg_11__3_/CK
comp_in_reg_11__4_/CK
comp_in_reg_11__5_/CK
comp_in_reg_11__6_/CK
comp_in_reg_11__7_/CK
comp_in_reg_12__0_/CK
comp_in_reg_12__1_/CK
comp_in_reg_12__2_/CK
comp_in_reg_12__3_/CK
comp_in_reg_12__4_/CK
comp_in_reg_12__5_/CK
comp_in_reg_12__6_/CK
comp_in_reg_12__7_/CK
comp_in_reg_13__0_/CK
comp_in_reg_13__1_/CK
comp_in_reg_13__2_/CK
comp_in_reg_13__3_/CK
comp_in_reg_13__4_/CK
comp_in_reg_13__5_/CK
comp_in_reg_13__6_/CK
comp_in_reg_13__7_/CK
comp_in_reg_14__0_/CK
comp_in_reg_14__1_/CK
comp_in_reg_14__2_/CK
comp_in_reg_14__3_/CK
comp_in_reg_14__4_/CK
comp_in_reg_14__5_/CK
comp_in_reg_14__6_/CK
comp_in_reg_14__7_/CK
comp_in_reg_15__0_/CK
comp_in_reg_15__1_/CK
comp_in_reg_15__2_/CK
comp_in_reg_15__3_/CK
comp_in_reg_15__4_/CK
comp_in_reg_15__5_/CK
comp_in_reg_15__6_/CK
comp_in_reg_15__7_/CK
arlen_s_inf_reg_1_/CK
out_valid_reg/CK
awvalid_s_inf_reg/CK
wlast_s_inf_reg/CK
wvalid_s_inf_reg/CK
arvalid_s_inf_reg/CK
rready_s_inf_reg/CK
}

set_ccopt_property -skew_group all_output target_insertion_delay 0.001ns
set_ccopt_property target_skew 1ns

ccopt_design
saveDesign ./DBS/CHIP_CTS.inn
